# IsTypeValidForSlot Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComponentRepeaterSlot..::..IsTypeValidForSlot Method
ComponentRepeaterSlot Class See Also
---
Determines whether instance of given family type can be used in the component repeater slot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsTypeValidForSlot(
	ElementId typeId
)
```

Visual Basic
---
```text
Public Function IsTypeValidForSlot ( _
	typeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsTypeValidForSlot(
	ElementId^ typeId
)
```

# ### Parameters
typeId
    Type: Autodesk.Revit.DB..::..ElementId The element id of the type.
# ### Return Value
True if the family type can be used in the component repeater slot.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace